Repository: AntonRomanuyk/QuizBackend
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uk

source: Failed to determine serializer: %s
uk: Не вдалося визначити серіалізатор: %s

source: Company ID and User ID are required.
uk: Необхідні ідентифікатори компанії та користувача.

source: This user is already a member of the company.
uk: Цей користувач вже є членом компанії.

source: An invitation is already pending for this user.
uk: Для цього користувача вже очікує запрошення.

source: Invitation sent successfully.
uk: Запрошення надіслано успішно.

source: Only pending invitations can be revoked.
uk: Можна відкликати лише очікуючі запрошення.

source: Invitation revoked successfully.
uk: Запрошення успішно відкликано.

source: Only pending invitations can be accepted.
uk: Можна прийняти лише очікуючі запрошення.

source: Invitation accepted successfully.
uk: Запрошення успішно прийнято.

source: Only pending invitations can be declined.
uk: Можна відхилити лише очікуючі запрошення.

source: Invitation declined successfully.
uk: Запрошення успішно відхилено.

source: This request is not pending.
uk: Цей запит не в очікуванні.

source: The request has been approved.
uk: Запит було схвалено.

source: The request has been rejected.
uk: Запит було відхилено.

source: Company ID is required.
uk: Необхідний ідентифікатор компанії.

source: Company not found.
uk: Компанію не знайдено.

source: You already have a pending request for this company.
uk: У вас вже є запит в очікуванні для цієї компанії.

source: Request sent successfully.
uk: Запит надіслано успішно.

source: Only pending requests can be canceled.
uk: Можна скасувати лише запити, що знаходяться в очікуванні.

source: Request canceled successfully.
uk: Запит успішно скасовано.

source: Failed to retrieve the company list: %s
uk: Не вдалося отримати список компаній: %s

source: Failed to create company: %s
uk: Не вдалося створити компанію: %s

source: User ID is required.
uk: Необхідний ідентифікатор користувача.

source: User is not a member of this company.
uk: Користувач не є членом цієї компанії.

source: User {user.username} has been removed from the company.
uk: Користувач {user.username} був видалений з компанії.

source: You have left the company.
uk: Ви покинули компанію.

source: User not in company members.
uk: Користувач не є членом компанії.

source: {user.username} is now an admin.
uk: {user.username} тепер є адміністратором.

source: Each question must have at least two answer options.
uk: У питанні має бути хочаб 2 варіанти відповіді.

source: The correct answer must be one of the answer options.
uk: Правильна відповідь має бути одним із варіантів відповіді.

source: A quiz must have at least two questions.
uk: У квізі має бути хочаб 2 питання.

source: Quiz does not exist.
uk: Квізу не існує.

source: All questions must be answered.
uk: Не на всіх питаннях обранна відповідь.

source: Invalid question ID: {answer['question_id']}
uk: Невірний ID питання: {answer['question_id']}.
